// graph LR
//       %% Set edges to be curved (try monotoneX for a nice alternative)
//       linkStyle default interpolate basis
      
//       A((材料标号)) --20板--> B(原材料库)
//       B(原材料库)-->C((单价))
//       B(原材料库) --> D((规格长))
//       B(原材料库) --> E((规格宽))
//       B(原材料库) --> F((规格厚))

//       G((零件长)) --550--> I(冲压件加工个数模型)
//       H((零件宽)) --42--> I(冲压件加工个数模型)

//       D((规格长)) --6000--> I(冲压件加工个数模型)
//       E((规格宽)) --2000--> I(冲压件加工个数模型)

//       I(冲压件加工个数模型) --> J((加工个数))

//       J((加工个数)) --570--> K(冲压件工艺定额模型)
//       D((规格长)) --6000--> K(冲压件工艺定额模型)
//       E((规格宽)) --2000--> K(冲压件工艺定额模型)
//       F((规格厚)) --3--> K(冲压件工艺定额模型)
//       K(冲压件工艺定额模型) --> L((工艺定额))

//       F((规格厚)) --550--> R(冲压件净重模型)
//       G((零件长)) --550--> R(冲压件净重模型)
//       H((零件宽)) --42--> R(冲压件净重模型)
//       R(冲压件净重模型) --> N((净重))

//       C((单价)) --4.5--> M(冲压件材料定额模型)
//       N((净重)) --0.59--> M(冲压件材料定额模型)
//       P((废料单价)) --0.90--> M(冲压件材料定额模型)
//       L((工艺定额)) --0.6013--> M(冲压件材料定额模型)

//       M(冲压件材料定额模型) --> Q((材料费))

//       click A OnClick_
//       class B libraryCss
//       class I,K,M,R modelrectCss
//       class A,G,H,P inCss
//       class C,D,E,F,J,L,N outCss
//       class AA,CC,DD,EE,FF,JJ,GG,HH,GG,LL,NN parameterCss
//       class Q resultCss